# 1. pandas
## pandas의 특징
### pandas의 특징
* Numpy를 내부적으로 활용함 (Numpy의 특징을 그대로 가짐)
* 데이터 분석에 특화된 데이터 구조 제공
* 데이터베이스에 쉽게 연결 가능
* json데이터나 table요소를 데이터 프레임으로 손쉽게 변형이 가능

In [ ]:
# 설치
# !pip install pandas
# !conda install pandas

# 2. Pandas에서 다루는 데이터 타입
## 1) DataFrame: 2차원의 표형식 데이터  => key : [value1,value2] 
* 데이터 프레임은 결국에는 딕셔너리다
### 2) Series: 1차원의 벡터형식 데이터  => list, tuple,ndattay

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {'이름': ['홍길동','장마철','소나기','더워요'],
     'Age' : [23,55,24,16],
     '성별' : ['male','female','female','male']}
)

In [16]:
print(df)
print(type(df))
print(df.shape)

    이름  Age      성별
0  홍길동   23    male
1  장마철   55  female
2  소나기   24  female
3  더워요   16    male
<class 'pandas.core.frame.DataFrame'>
(4, 3)

In [3]:
df

    이름  Age      성별
0  홍길동   23    male
1  장마철   55  female
2  소나기   24  female
3  더워요   16    male

In [5]:
display(df)   #주피터에서만 쓰는 명령어 = 디스플레이 vs코드에서는 읽히지 않아

    이름  Age      성별
0  홍길동   23    male
1  장마철   55  female
2  소나기   24  female
3  더워요   16    male

In [4]:
df['이름']

0    홍길동
1    장마철
2    소나기
3    더워요
Name: 이름, dtype: object

In [17]:
display(df['이름'])     #열이 없는 벡터
print(type(df['이름']))
print(df['이름'].shape)
print(df['이름'].ndim)
print()
display(df[['이름']])    #열이 생김- 2차원데이터
print(type(df[['이름']]))
print(df[['이름']].shape)
print(df[['이름']].ndim)

0    홍길동
1    장마철
2    소나기
3    더워요
Name: 이름, dtype: object

<class 'pandas.core.series.Series'>
(4,)
1

    이름
0  홍길동
1  장마철
2  소나기
3  더워요

<class 'pandas.core.frame.DataFrame'>
(4, 1)
2

In [ ]:
#한줄짜리라도 시리즈로 출력하느냐, 데이터프레임으로 출력하느냐에따라 다르다
#헷갈리면 shape, ndim찍어보면서 차원이랑 확인해봐라

In [ ]:
#시리즈 만드는 법부터 하나씩 확인해보자
#타이타닉데이터로 확인해보는 작업